In [2]:
#defining a DataFrame
import numpy as np
import pandas as pd
dict1={'color':
               ['Red','Yellow','Blue'],
       'Object':
               ['Ball','Banana','Table'],
       'Price':
               [2.3, 4 , 5.3]}

df=pd.DataFrame(dict1,columns=['color','Object'],index=['one','two','three'])
print(df)

        color  Object
one       Red    Ball
two    Yellow  Banana
three    Blue   Table

In [41]:
#Defining a DataFrame
df=pd.DataFrame(np.arange(16).reshape((4,4)),columns=['color','Object','price','name'])
print(df)

   color  Object  price  name
0      0       1      2     3
1      4       5      6     7
2      8       9     10    11
3     12      13     14    15

In [32]:
#Selecting Elements From Data Frame
df.columns
df.values
df.index

Index(['one', 'two', 'three', 'four'], dtype='object')

In [35]:
#Selecting Elements From Data Frame
df['color']
df.color

one       0
two       4
three     8
four     12
Name: color, dtype: int32

In [37]:
#Selecting rows From Data Frame
df.loc['two']

color     4
Object    5
price     6
name      7
Name: two, dtype: int32

In [51]:
#if you need to select a portion pf the frame
df.loc[0:2]

   color  Object  price  name
0      0       1      2     3
1      4       5      6     7
2      8       9     10    11

In [52]:
#if you need to select multiple rows
df.loc[[0,2]]

   color  Object  price  name
0      0       1      2     3
2      8       9     10    11

In [54]:
#select a value in data Frame
df['Object'][1]

5

In [60]:
# naming dataframe
df.columns.name='item'
df.index.name='index'
df

item   color  Object  price  name
index
0          0       1      2     3
1          4       5      6     7
2          8       9     10    11
3         12      13     14    15

In [61]:
#add new column to data frame
df['new']=12

In [65]:
df['new']=[1.3,4.2,5.3,3.3]
df['new'][2]=5
df

<ipython-input-65-26efd9001cf7>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['new'][2]=5

item   color  Object  price  name  new
index
0          0       1      2     3  1.3
1          4       5      6     7  4.2
2          8       9     10    11  5.0
3         12      13     14    15  3.3

In [66]:
df

item   color  Object  price  name  new
index
0          0       1      2     3  1.3
1          4       5      6     7  4.2
2          8       9     10    11  5.0
3         12      13     14    15  3.3

In [68]:
#Membership of a Value
df.isin([1.0,15,3.3])

item   color  Object  price   name    new
index
0      False    True  False  False  False
1      False   False  False  False  False
2      False   False  False  False  False
3      False   False  False   True   True

In [69]:
df[df.isin([1.0,15,3.3])]

item   color  Object  price  name  new
index
0        NaN     1.0    NaN   NaN  NaN
1        NaN     NaN    NaN   NaN  NaN
2        NaN     NaN    NaN   NaN  NaN
3        NaN     NaN    NaN  15.0  3.3

In [75]:
del df['new']
df

item   color  Object  price  name
index
0          0       1      2     3
1          4       5      6     7
2          8       9     10    11
3         12      13     14    15

In [79]:
# filtering
df[df['price']<8]

item   color  Object  price  name
index
0          0       1      2     3
1          4       5      6     7

In [80]:
#NestedDict
nestdict = {'red':{2012: 22, 2013: 33},
 'white':{2011: 13, 2012: 22, 2013: 16},
'blue': {2011: 17, 2012: 27, 2013: 18}}
frame2 = pd.DataFrame(nestdict)
frame2

       red  white  blue
2012  22.0     22    27
2013  33.0     16    18
2011   NaN     13    17

In [81]:
#tranposition of dataframe
frame2.T

       2012  2013  2011
red    22.0  33.0   NaN
white  22.0  16.0  13.0
blue   27.0  18.0  17.0

In [90]:
ser=frame2.index

In [93]:
#Index object
ser = pd.Series([5,0,3,8,4], index=['red','blue','yellow','white','green'])
ser.index

Index(['red', 'blue', 'yellow', 'white', 'green'], dtype='object')

In [94]:
ser.idxmin()

'blue'

In [95]:
ser.idxmax()

'white'

In [96]:
serd = pd.Series(range(6), index=['white','white','blue','green',
'green','yellow'])

In [97]:
serd['white']

white    0
white    1
dtype: int64

In [98]:
#To Check if there is duplicate in the index
serd.index.is_unique

False

In [99]:
#Reindexing
ser = pd.Series([2,5,7,4], index=['one','two','three','four'])
ser

one      2
two      5
three    7
four     4
dtype: int64

In [101]:
ser = ser.reindex(['four','three','one','five'])

In [102]:
ser

four     4.0
three    7.0
one      2.0
five     NaN
dtype: float64

In [108]:
#reindex Method 2
ser3 = pd.Series([1,5,6,3],index=[0,3,5,6])
ser3=ser3.reindex(range(6),method='ffill')
ser3

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [110]:
#reindex Method 3
ser3 = pd.Series([1,5,6,3],index=[0,3,5,6])
ser3=ser3.reindex(range(6),method='bfill')
ser3

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

In [3]:
#Dropping
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [6]:
ser.drop('yellow')

red      0.0
blue     1.0
white    3.0
dtype: float64

In [7]:
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [8]:
ser.drop(['yellow','white'])

red     0.0
blue    1.0
dtype: float64

In [9]:
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [10]:
#Dropping Frame
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])

In [11]:
frame.drop(['yellow','red'])

       ball  pen  pencil  paper
blue      4    5       6      7
white    12   13      14     15

In [13]:
frame.drop(['ball','pen'],axis=1)

        pencil  paper
red          2      3
blue         6      7
yellow      10     11
white       14     15

In [14]:
#Arithmetic And Data Alignment
s1 = pd.Series([3,2,5,1],['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1],['white','yellow','black','blue','brown'])
s1+s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [15]:
#Arithmetic And Data Alignment DataFrame
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame2 = pd.DataFrame(np.arange(12).reshape((4,3)),
index=['blue','green','white','yellow'],
columns=['mug','pen','ball'])
frame1+frame2

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [16]:
#flexible arithmetic methods
frame1.add(frame2)

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN

In [17]:
#Operations Between DataFrame and Series
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
ser = pd.Series(np.arange(4), index=['ball','pen','pencil','paper'])
frame-ser

        ball  pen  pencil  paper
red        0    0       0      0
blue       4    4       4      4
yellow     8    8       8      8
white     12   12      12     12

In [19]:
#Functions by Element
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
np.sqrt(frame)

            ball       pen    pencil     paper
red     0.000000  1.000000  1.414214  1.732051
blue    2.000000  2.236068  2.449490  2.645751
yellow  2.828427  3.000000  3.162278  3.316625
white   3.464102  3.605551  3.741657  3.872983

In [20]:
#Functions by Row or Column
f=lambda x:x.max()-x.min()

In [22]:
frame.apply(f)

ball      12
pen       12
pencil    12
paper     12
dtype: int64

In [23]:
#row level 
frame.apply(f, axis=1)

red       3
blue      3
yellow    3
white     3
dtype: int64

In [24]:
#Returning a serie
def f(x):
    return pd.Series([x.min(), x.max()], index=['min','max'])

In [25]:
frame.apply(f)

     ball  pen  pencil  paper
min     0    1       2      3
max    12   13      14     15

In [26]:
#statistic funtions
frame.sum()

ball      24
pen       28
pencil    32
paper     36
dtype: int64

In [30]:
#Sorting
ser = pd.Series([5,0,3,8,4],
index=['red','blue','yellow','white','green'])
ser.sort_index()
ser.sort_index(ascending=False)

yellow    3
white     8
red       5
green     4
blue      0
dtype: int64

In [31]:
#sorting Frame
frame = pd.DataFrame(np.arange(16).reshape((4,4)),
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame.sort_index()

        ball  pen  pencil  paper
blue       4    5       6      7
red        0    1       2      3
white     12   13      14     15
yellow     8    9      10     11

In [33]:
frame.sort_index(axis=1)

        ball  paper  pen  pencil
red        0      3    1       2
blue       4      7    5       6
yellow     8     11    9      10
white     12     15   13      14

In [49]:
#Sorting Series Values
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])
ser.sort_values(ascending=False)

white     3.0
yellow    2.0
blue      1.0
red       0.0
dtype: float64

In [53]:
 #rank Series
ser.rank(method='first')
ser.rank(ascending=False)

red       4.0
blue      3.0
yellow    2.0
white     1.0
dtype: float64

In [46]:
ser.rank(method='first')

blue      1.0
yellow    2.0
green     3.0
red       4.0
white     5.0
dtype: float64

In [35]:
frame.sort_values(by='pen')

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [36]:
frame.sort_values(by=['pen','pencil'])

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [54]:
#Correlation and Covariance
seq2 = pd.Series([3,4,3,4,5,4,3,2],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
seq = pd.Series([1,2,3,4,4,3,2,1],['2006','2007','2008',
'2009','2010','2011','2012','2013'])
seq2.corr(seq)

0.7745966692414834

In [55]:
seq2.cov(seq)

0.8571428571428571

In [56]:
 frame2 = pd.DataFrame([[1,4,3,6],[4,5,6,1],[3,3,1,5],[4,1,6,4]],
index=['red','blue','yellow','white'],
columns=['ball','pen','pencil','paper'])
frame2.corr()

            ball       pen    pencil     paper
ball    1.000000 -0.276026  0.577350 -0.763763
pen    -0.276026  1.000000 -0.079682 -0.361403
pencil  0.577350 -0.079682  1.000000 -0.692935
paper  -0.763763 -0.361403 -0.692935  1.000000

In [57]:
#Correlation between Serie and Frame
ser = pd.Series([0,1,2,3,9],
index=['red','blue','yellow','white','green'])
frame2.corrwith(ser)

ball      0.730297
pen      -0.831522
pencil    0.210819
paper    -0.119523
dtype: float64

In [58]:
ser = pd.Series([0,1,2,np.NaN,9],
index=['red','blue','yellow','white','green'])
ser.dropna()

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [60]:
ser[ser.notnull()]

red       0.0
blue      1.0
yellow    2.0
green     9.0
dtype: float64

In [61]:
frame3 = pd.DataFrame([[6,np.nan,6],[np.nan,np.nan,np.nan],[2,np.nan,5]],
index = ['blue','green','red'],
columns = ['ball','mug','pen'])
frame3

       ball  mug  pen
blue    6.0  NaN  6.0
green   NaN  NaN  NaN
red     2.0  NaN  5.0

In [62]:
frame3.dropna()

Empty DataFrame
Columns: [ball, mug, pen]
Index: []

In [64]:
frame3.dropna(how='all',axis=1)

       ball  pen
blue    6.0  6.0
green   NaN  NaN
red     2.0  5.0

In [65]:
#Filling in NaN Occurrences
frame3.fillna(0)

       ball  mug  pen
blue    6.0  0.0  6.0
green   0.0  0.0  0.0
red     2.0  0.0  5.0

In [66]:
#Filling in NaN Occurrences based on columns
frame3.fillna({'ball':1,'mug':0,'pen':99})

       ball  mug   pen
blue    6.0  0.0   6.0
green   1.0  0.0  99.0
red     2.0  0.0   5.0

In [67]:
mser = pd.Series(np.random.rand(8),
index=[['white','white','white','blue','blue','red','red',
 'red'],
['up','down','right','up','down','up','down','left']])

In [68]:
mser

white  up       0.861079
       down     0.821122
       right    0.714397
blue   up       0.872110
       down     0.071464
red    up       0.621706
       down     0.913881
       left     0.094147
dtype: float64

In [69]:
mser['white']

up       0.861079
down     0.821122
right    0.714397
dtype: float64

In [70]:
mser[:,'up']

white    0.861079
blue     0.872110
red      0.621706
dtype: float64

In [71]:
#This function converts the
#series with a hierarchical index to a simple dataframe, where the second set of indexes is
#converted into a new set of columns
mser.unstack()

           down      left     right        up
blue   0.071464       NaN       NaN  0.872110
red    0.913881  0.094147       NaN  0.621706
white  0.821122       NaN  0.714397  0.861079

In [75]:
frame

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [74]:
frame.stack()

red     ball       0
        pen        1
        pencil     2
        paper      3
blue    ball       4
        pen        5
        pencil     6
        paper      7
yellow  ball       8
        pen        9
        pencil    10
        paper     11
white   ball      12
        pen       13
        pencil    14
        paper     15
dtype: int32

In [78]:
#At the time the dataframe is declared, you have to define an array of arrays for the index and columns options.
mframe = pd.DataFrame(np.random.randn(16).reshape(4,4),
index=[['white','white','red','red'], ['up','down','up','down']],
 columns=[['pen','pen','paper','paper'],[1,2,1,2]])
mframe.columns.names = ['objects','id']
mframe.index.names = ['colors','status']

In [80]:

mframe.swaplevel('colors','status')

objects             pen               paper
id                    1         2         1         2
status colors
up     white   0.088143  0.045721  0.080856 -1.037298
down   white  -0.912535  0.311399  0.860551 -1.180662
up     red    -0.055435 -0.941929  0.634286 -0.014578
down   red    -0.227760  0.337256 -0.294294  1.120599

In [81]:
mframe.sort_index(level='colors')

objects             pen               paper
id                    1         2         1         2
colors status
red    down   -0.227760  0.337256 -0.294294  1.120599
       up     -0.055435 -0.941929  0.634286 -0.014578
white  down   -0.912535  0.311399  0.860551 -1.180662
       up      0.088143  0.045721  0.080856 -1.037298

In [82]:
mframe.sum(level='colors')

objects       pen               paper
id              1         2         1         2
colors
white   -0.824392  0.357119  0.941407 -2.217960
red     -0.283195 -0.604673  0.339992  1.106021

In [83]:
mframe.sum(level='id', axis=1)

id                    1         2
colors status
white  up      0.168999 -0.991577
       down   -0.051984 -0.869263
red    up      0.578851 -0.956506
       down   -0.522054  1.457855